# AnalyticalLinkJoinedNodes Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AnalyticalModelFailures..::..AnalyticalLinkJoinedNodes Property
BuiltInFailures..::..AnalyticalModelFailures Class See Also
---
Analitycal Link is invalid. Reference nodes have been joined.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AnalyticalLinkJoinedNodes { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalLinkJoinedNodes As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AnalyticalLinkJoinedNodes {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace